* WHAT 

  - parser for curl command
    - you can get HTTP Headers, data, url information from curl command
  
* USAGE

  - if you get cCurl command for firefox, you can get information from it 
    using curl_parser module.

  #+begin_src python :results output replace :exports both
  from pprint import pprint
  from curl_parser import parse
  cmd="""\
  curl 'http://www.naver.com/' -H 'Pragma: no-cache' -H 'Accept-Encoding: gzip, deflate, sdch' -H 'Accept-Language: en-US,en;q=0.8,ko;q=0.6' -H 'Upgrade-Insecure-Requests: 1' -H 'User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_2) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.95 Safari/537.36' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8' -H 'Cache-Control: no-cache' -H 'Cookie: npic=0' -H 'Connection: keep-alive' --compressed
  """
  cmd = parse(cmd)

  pprint(cmd)
  #+end_src

  #+RESULTS:
  #+begin_example
  {'compressed': True,
   'cookies': {'npic': '0'},
   'data': None,
   'headers': {'Accept': 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8',
               'Accept-Encoding': 'gzip, deflate, sdch',
               'Accept-Language': 'en-US,en;q=0.8,ko;q=0.6',
               'Cache-Control': 'no-cache',
               'Connection': 'keep-alive',
               'Cookie': None,
               'Pragma': 'no-cache',
               'Upgrade-Insecure-Requests': '1',
               'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_2) '
                             'AppleWebKit/537.36 (KHTML, like Gecko) '
                             'Chrome/55.0.2883.95 Safari/537.36'},
   'url': 'http://www.naver.com/'}
#+end_example

  




